tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Application launcher and productivity software
cask "alfred"
# SQL client and database management tool
cask "arctype"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Server and cloud storage browser
cask "cyberduck"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Client for the Google Drive storage service
cask "google-drive-file-stream"
# Remote desktop client
cask "microsoft-remote-desktop"
# Collaboration platform for API development
cask "postman"
# 3D CAD software
cask "shapr3d"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
