tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Manage your Java environment
brew "jenv"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Development kit for the Java programming language
brew "openjdk"
# Python version management
brew "pyenv"
# UNIX shell (command interpreter)
brew "zsh"
# Application launcher and productivity software
cask "alfred"
# SQL client and database management tool
cask "arctype"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Server and cloud storage browser
cask "cyberduck"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Client for the Google Drive storage service
cask "google-drive-file-stream"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Remote desktop client
cask "microsoft-remote-desktop"
# JDK from Oracle
cask "oracle-jdk"
# Collaboration platform for API development
cask "postman"
# 3D CAD software
cask "shapr3d"
# Team communication and collaboration software
cask "slack"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
mas "Snappy", id: 512617038
